In [5]:
print("hello world")

hello world

**Data Exploration and Leading**

In [6]:
# import pandas as pd
import pandas as pd

In [7]:
print(pd.__version__)

2.3.0

In [8]:
df = pd.read_csv("Walmart.csv")

df.shape

(10051, 11)

In [9]:
df.head(2)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48

In [10]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [12]:
df.duplicated().sum()

np.int64(51)

In [13]:
df.drop_duplicates(inplace = True)

In [14]:
df.duplicated().sum()

np.int64(0)

In [15]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [16]:
# Drop all missing data
df.dropna(inplace = True)

In [17]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [18]:
df["unit_price"] = df["unit_price"].str.replace("$" , "").astype(float)

In [19]:
df["unit_price"].dtypes

dtype('float64')

In [20]:
df["total"] = df["unit_price"] * df["quantity"]

In [21]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [22]:
df.columns = df.columns.str.lower()

In [23]:
df.sample(5)

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
9968,9969,WALM058,Port Arthur,Home and lifestyle,42.0,3.0,12/04/21,9:38:00,Cash,3.0,0.33,126.0
4587,4588,WALM005,Fort Worth,Fashion accessories,58.0,2.0,28/12/20,18:22:00,Credit card,4.0,0.48,116.0
4964,4965,WALM091,Little Elm,Home and lifestyle,62.0,3.0,13/09/21,19:20:00,Credit card,4.0,0.33,186.0
228,229,WALM049,North Richland Hills,Electronic accessories,90.7,6.0,26/02/19,10:52:00,Cash,5.3,0.48,544.2
2685,2686,WALM017,McKinney,Fashion accessories,31.0,1.0,10/07/21,6:28:00,Ewallet,9.0,0.48,31.0

In [24]:
df.to_csv("walmart_clean_data.csv" , index = False)

In [ ]:
from sqlalchemy import create_engine
import sqlalchemy as sal
import pandas as pd

df = pd.read_csv("walmart_clean_data.csv")


engine = sal.create_engine("postgresql+psycopg2://postgres:password@localhost:xxxx/database_name")



con = engine.connect()

df.to_sql("walmart_clean_data" , con=con , index=False , if_exists="replace")
con.close()
print("Done successfully!!")